In [2]:
import pandas as pd

In [3]:
pd.__version__

'2.2.2'

In [4]:
my_series = pd.Series([10,20,30,40,50], index = ["a","b","c","d","e"])
my_series

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [5]:
type(my_series)

pandas.core.series.Series

In [6]:
my_series["b":"d"]

b    20
c    30
d    40
dtype: int64

In [7]:
my_series

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [8]:
my_series + 1

a    11
b    21
c    31
d    41
e    51
dtype: int64

In [9]:
my_series * 2

a     20
b     40
c     60
d     80
e    100
dtype: int64

In [10]:
my_series

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [11]:
my_series.dtype

dtype('int64')

In [12]:
my_series[0]

C:\Users\OPEYODE\AppData\Local\Temp\ipykernel_33140\350777571.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  my_series[0]

10

In [13]:
my_series.size

5

In [14]:
my_series.shape

(5,)

In [15]:
my_series.head(3)

a    10
b    20
c    30
dtype: int64

In [16]:
my_series.tail(2)

d    40
e    50
dtype: int64

In [17]:
my_series.describe()

count     5.000000
mean     30.000000
std      15.811388
min      10.000000
25%      20.000000
50%      30.000000
75%      40.000000
max      50.000000
dtype: float64

In [18]:
my_series.sort_values(ascending=False)

e    50
d    40
c    30
b    20
a    10
dtype: int64

In [19]:
data = {"Name": ["John", "Emily", "Kate","Sam"],
        "Age": [21,37,29,25],
        "City": ["Seattle","Texas","Miami","Denva"]}

In [20]:
data

{'Name': ['John', 'Emily', 'Kate', 'Sam'],
 'Age': [21, 37, 29, 25],
 'City': ['Seattle', 'Texas', 'Miami', 'Denva']}

In [21]:
df = pd.DataFrame(data)

In [22]:
df

    Name  Age     City
0   John   21  Seattle
1  Emily   37    Texas
2   Kate   29    Miami
3    Sam   25    Denva

In [23]:
data_list = ["John",21,"Seattle"], ["Emily", 37, "Texas"],["Kate",29,"Miami"],["Sam",25,"Denva"]

In [24]:
data_list

(['John', 21, 'Seattle'],
 ['Emily', 37, 'Texas'],
 ['Kate', 29, 'Miami'],
 ['Sam', 25, 'Denva'])

In [25]:
df_list = pd.DataFrame(data_list, columns = ["Name", "Age", "City" ])

In [26]:
df_list = pd.DataFrame(data_list, columns = ["Name","Age","City"])

In [27]:
df_list

    Name  Age     City
0   John   21  Seattle
1  Emily   37    Texas
2   Kate   29    Miami
3    Sam   25    Denva

In [28]:
 import numpy as np

In [29]:
data_array = np.array ([[1,2,3],[4,5,6],[7,8,9]])

In [30]:
data_array

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [31]:
df_array = pd.DataFrame(data_array, columns= ["A","B","C"])

In [32]:
type(df_array)

pandas.core.frame.DataFrame

In [33]:
df_array

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

I am duplicating this file.